app/controllers/assets_controller.rb

  def upload
    @asset  = @current_user.assets.create! params[:asset]

    if @asset.errors.empty? then
      @post = @current_user.posts.create(params[:post])

      if @post.errors.empty? then
        @asset.update_attributes(:post_id => @post.id, :email => @post.email)
---
INSERT INTO `assets` (`size`, `created_at`, `content_type`, `updated_at`, `post_id`, `user_id`, `filename`, `email`) VALUES(40345, '2010-09-20 22:28:05', 'image/png', '2010-09-20 22:28:05', NULL, NULL, 'Image_7.png', NULL)
SELECT * FROM `assets` WHERE (`assets`.post_id = 20)
SELECT count(*) AS count_all FROM `assets` WHERE (`assets`.post_id = 20)
INSERT INTO `posts` (`position`, `mail_me_comments`, `created_at`, `updated_at`, `user_id`, `content`, `email`) VALUES(5, 1, '2010-09-20 22:28:05', '2010-09-20 22:28:05', NULL, 'Image d\'accueil que je trouve cool pour la page d\'authentification. Qu\'en pensez-vous ?', NULL)
SELECT * FROM `posts` WHERE (1 = 1) ORDER BY position DESC LIMIT 1
SELECT count(*) AS count_all FROM `posts`
UPDATE `assets` SET `updated_at` = '2010-09-20 22:49:31', `email` = 0, `post_id` = 20 WHERE `id` = 4