app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
INSERT INTO `comments` (`created_at`, `updated_at`, `post_id`, `usefulness`, `user_id`, `content`, `email`) VALUES('2010-09-18 09:26:16', '2010-09-18 09:26:16', 4, 0, NULL, 'This comment sucks !', 'tracy.loisel@onwild.com')
---
  def create
    @post     = Post.find(params[:post])
    @comment  = @post.comments.create(params[:comment])

SELECT * FROM `comments` WHERE (`comments`.`id` = 5)
DELETE FROM `comments` WHERE `id` = 5
---
  def destroy
    @comment = Comment.find(params[:comment])
    @comment.destroy