app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :order => "position, created_at DESC", :include => [:assets, :comments])
---
SELECT * FROM `assets` WHERE (`assets`.post_id = 17)
SELECT * FROM `comments` WHERE (`comments`.post_id = 12)

  def create
    @post = @current_user.posts.build(params[:post])
    if @post.save then
---
INSERT INTO `posts` (`mail_me_comments`, `created_at`, `updated_at`, `user_id`, `content`, `email`) VALUES(1, '2010-09-17 23:35:43', '2010-09-17 23:35:43', NULL, 'Juste un petit test pour Fred !', 'tracy.loisel@onwild.com')

  def destroy
    @post = @current_user.posts.find(params[:post])
    if @post then
      Feed.destroy_post(@post)
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 10)
DELETE FROM `posts` WHERE `id` = 10

  def sort_posts
    params[:posts_list].each_with_index do |id, index|
      Post.update_all(['position=?', index+1], ['id=?', id])
---
UPDATE `posts` SET position=1 WHERE (id='10')

  def show_comments
    @post = Post.find(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 4)